import DATABASE, menu_continue, os


def one():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │██████Вывести БД с пользователями██████│
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def two():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │██████Вывести БД с фильмами████████████│
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def three():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │██████Вывести БД с залами██████████████│
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def four():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │██████Вывести Киноафишу████████████████│
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def five():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │██████Добавить фильм в БД██████████████│
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def six():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │██████Добавить кинозал в БД████████████│
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def seven():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │██████Удалить фильм из БД██████████████│
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def eight():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │██████Удалить кинозал из БД████████████│
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def nine():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │██████Редактировать Киноафишу██████████│
    │                                       │
    │      Выйти из режима Admin            │
    │                                       │
    └───────────────────────────────────────┘
    """
def zero():
    return """
    ┌───────────────────────────────────────┐
    │      _ __ ___   ___ _ __  _   _       │
    │     | '_ ` _ \ / _ \ '_ \| | | |      │
    │     | | | | | |  __/ | | | |_| |      │
    │     |_| |_| |_|\___|_| |_|\__,_|      │
    │                                       │
    │───────────────────────────────────────│
    │                                       │
    │      Вывести БД с пользователями      │
    │      Вывести БД с фильмами            │
    │      Вывести БД с залами              │
    │      Вывести Киноафишу                │
    │                                       │
    │      Добавить фильм в БД              │
    │      Добавить кинозал в БД            │
    │                                       │
    │      Удалить фильм из БД              │
    │      Удалить кинозал из БД            │
    │                                       │
    │      Редактировать Киноафишу          │
    │                                       │
    │██████Выйти из режима Admin████████████│
    │                                       │
    └───────────────────────────────────────┘
    """



def start_ADMIN_main():

    lst = [one(), two(), three(), four(), five(), six(), seven(), eight(), nine(), zero()]

    count = 0
    key = None
    while True:
        for index in range(len(lst)):
            if index == count % len(lst):
                os.system('CLS')
                print(lst[count % len(lst)])
                key = input('Введи: ')
        count += 1
        if key == 'y':
            print(count % len(lst))
            if count % len(lst) == 0:
                input('Приходите ещё!')
                break
            else:
                menu_continue.contTinue(str((count) % len(lst)))
                continue