import os
import DATABASE
import DBase

from ADMIN_main import start_ADMIN_main
from USER_main import start_USER_main
from random import randint
import time


os.system('CLS')
for i in range(1, 14):
    print('\n' * 15)
    print(56 * " " + "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n" + 56 * " " +
          "█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█\n" + 56 * " " +
          "█░" + "██░" * (i - 1) + "░░░" * (13 - i) + "█\n" + 56 * " " +
          "█░" + "██░" * (i - 1) + "░░░" * (13 - i) + "█\n" + 56 * " " +
          "█▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█\n" + 56 * " " +
          "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n" + 56 * " " +
          "░░█░░░░█▀▀▀█░█▀▀█░█▀▀▄░▀█▀░█▄░░█░█▀▀█░░\n" + 56 * " " +
          "░░█░░░░█░░░█░█▄▄█░█░░█░░█░░█░█░█░█░▄▄░░\n" + 56 * " " +
          "░░█▄▄█░█▄▄▄█░█░░█░█▄▄▀░▄█▄░█░░▀█░█▄▄█░░\n" + 56 * " " +
          "░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n")
    time.sleep(randint(5, 50) / 100)
    os.system('CLS')

while True:
    print('\033[0m')
    key = None
    while key != ' ':
        os.system('CLS')
        print("""\033[0m\033[32m                                                                                                                                                           
                                                                                                                                                            
                                                                                                                                                            
         /$$$$$$        /$$$$$$   /$$$$$$$   /$$$$$$$    /$$$$$$                                                                                            
        | $$  \$$      /$$__  $$ | $$____/  | $$__  $$  /$$__  $$                                                                                           
        | $$  |$$     | $$  \ $$ | $$       | $$  \ $$ | $$  \ $$                                                                                           
        / $$  |$$     | $$  | $$ | $$$$$$$  | $$$$$$$/ | $$  | $$                                                                                           
    / $$$$$$$$$$$$$$$ | $$  | $$ | $$__  $$ | $$____/  | $$  | $$                                                                                           
    | $$ _________ $$ | $$  | $$ | $$  \ $$ | $$       | $$  | $$                                                                                           
    | $$         | $$ |  $$$$$$/ | $$$$$$$/ | $$       |  $$$$$$/                                                                                           
    |__/         |__/  \______/  |_______/  |__/        \______/                                                                                            
                                                                                                                                                            
                                     /$$$$$$$$   /$$$$$$   /$$ /$$| /$$    /$$$$$$    /$$$$$$    /$$$$$$   /$$$$$$$    /$$$$$$   /$$$$$$$$  /$$             
                                    | $$  | $$  /$$__  $$ | $$ |$$ / $$   /$$__  $$  /$$__  $$  /$$__  $$ | $$__  $$  /$$__  $$ |__  $$__/ | $$             
                                    | $$  | $$ | $$  \ $$ |  $$|$$/ $$/  | $$  \ $$ | $$  \ $$ | $$  \ $$ | $$  \ $$ | $$  \ $$    | $$    | $$$$$$$        
                                    | $$  | $$ | $$  | $$  \  $$$$$$ /   | $$$$$$$$ | $$  | $$ | $$  | $$ | $$$$$$$  | $$$$$$$$    | $$    | $$__  $$       
                                    | $$  | $$ | $$  | $$   >$$|$$\ $$   | $$__  $$ | $$  | $$ | $$  | $$ | $$__  $$ | $$__  $$    | $$    | $$  \ $$       
                                    | $$  | $$ | $$  | $$  /$$/|$$ \ $$  | $$  | $$ | $$  | $$ | $$  | $$ | $$  \ $$ | $$  | $$    | $$    | $$  | $$       
                                    | $$  | $$ |  $$$$$$/ | $$ |$$| \ $$ | $$  | $$ | $$  | $$ |  $$$$$$/ | $$$$$$$/ | $$  | $$    | $$    | $$$$$$$/       
                                    |__/  |__/  \______/  |__/ |__| |__/ |__/  |__/ |__/  |__/  \______/  |_______/  |__/  |__/    |__/    |_______/        
                                                                                                                                                            
                                                                                                                                                            
                                                                                                                                                            
                                                                         /$$$$$$$                                                                           
                                                                        | $$__  $$                                                                          
                                                                        | $$  \ $$                                                                          
                                                                        | $$$$$$$                                                                           
                                                                        | $$__  $$                                                                          
                                                                        | $$  \ $$                                                                          
                                                                        | $$$$$$$/                                                                          
                                                                        |_______/                                                                           
                                                                                                                                                            
                                                                                                                                                            
                                                                                                                                                            
     /$$ /$$     /$$$$$$$   /$$$$$$$    /$$$$$$     /$$     /$$$$$$    /$$$$$$        /$$   /$$  /$$   /$$  /$$   /$$   /$$$$$$      /$$ /$$       /$$      
    | $$| $$    | $$__  $$ | $$__  $$  /$$__  $$  /$$$$    /$$$_  $$  /$$$_  $$      | $$  /$$/ | $$  | $$ | $$  | $$  /$$__  $$    | $$| $$      | $$      
    | $$| $$    | $$  \ $$ | $$  \ $$ | $$  \ $$ |_  $$   | $$$$\ $$ | $$$$\ $$      | $$ /$$/  | $$  | $$ | $$  | $$ | $$  \ $$    | $$| $$      | $$      
    |__/|__/    | $$$$$$$/ | $$$$$$$/ | $$  | $$   | $$   | $$ $$ $$ | $$ $$ $$      | $$$$$/   | $$  | $$ | $$$$$$$$ | $$  | $$    |__/|__/      | $$      
                | $$____/  | $$__  $$ | $$  | $$   | $$   | $$\ $$$$ | $$\ $$$$      | $$  $$   | $$  | $$ | $$__  $$ | $$  | $$                  |__/      
                | $$       | $$  \ $$ | $$  | $$   | $$   | $$ \ $$$ | $$ \ $$$      | $$\  $$  | $$  | $$ | $$  | $$ | $$  | $$                            
                | $$       | $$  | $$ |  $$$$$$/  /$$$$$$ |  $$$$$$/ |  $$$$$$/      | $$ \  $$ |  $$$$$$/ | $$  | $$ |  $$$$$$/                   /$$      
                |__/       |__/  |__/  \______/  |______/  \______/   \______/       |__/  \__/  \______/  |__/  |__/  \______/                   |__/      
                                                                                                                                                            
""")
        key = input('\033[0m\033[5m[ПОДСКАЗКА]: нажмите сочетание клавиш "SPACE" + "Enter"')
    os.system('CLS')
    print("""\033[0m\033[33m                                                                                                                                                           
                                                                               ▄▄                                                                          
                                                                             ▄▄██▄▄                                                                        
                                                                             ▀▀██▀▀                                                                        
                                                                    ▄▄▄███████▄██▄███████▄▄▄                                                               
                                                                ▄█████▀▄  ▀  ██████  ▀  ▄▀█████▄                                                           
                                                              ▄█▀▀ ██          ██▀         ██ ▀▀█▄                                                         
                                                             ██  ▄██▀▀         ██         ▀▀██▄ ▀██                                                        
                                                            ██    ██           ██           ██    ██                                                       
                                                            ██ █  ██▀▀         ██         ▀▀██  █ ██                                                       
                                                            ██    ▀██▄         ██         ▄██▀    ██                                                       
                                                             ██ ▀  ▀██▀      ▄████▄      ▀▄█▀  ▀ ██                                                        
                                                             ▀██  ▄ ▀██▀▄    ██▄▄██    ▄▀██▀ ▄ ▄██▀                                                        
                                                               ██▄▄▄▄██████████████████████▄▄▄▄█▀                                                          
                                                                █▀▀▀▀▀▀  ▄▄▄▄▄    ▄▄▄▄▄  ▀▀▀▀▀▀█                                                           
                                                                 ███     ▀███      ███▀     ███                                                            
                                                                 ▀██▄    ▀▀▀▀▀    ▀▀▀▀▀    ▄██▀                                                            
                                                                 ▄▄▄▄██████████████████████▄▄▄▄                                                            
                                                                  ▀▀▀▀                    ▀▀▀▀                                                             
                                                                                                                                                           """)

    l = input("""\033[33m                                                                                                                                                           
                                                             _                 _                                                                           
                                                            | |               (_)        _                                                                 
                                                            | |     ___   __ _ _ _ __   (_)                                                                
                                                            | |    / _ \ / _` | | '_ \                                                                     
                                                            | |___| (_) | (_) | | | | |  _                                                                 
                                                            \_____/\___/ \__, |_|_| |_| (_)                                                                
                                                                          __/ |                                                                            
                                                                         |___/                                                                             
                                                                                                                                                           
                                                                \033[0m""")
    p = input("""\033[33m                                                                                                                                                           
                                                            ______                                    _                                                    
                                                            | ___ \                                  | |  _                                                
                                                            | |_/ /_ _ ___ ___ __      _____  _ __ __| | (_)                                               
                                                            |  __/ _` / __/ __\  \ /\ / / _ \| '__/ _` |                                                   
                                                            | | | (_| \__ \__ \ \ V  V / (_) | | | (_| |  _                                                
                                                            \_|  \__,_|___/___/  \_/\_/ \___/|_|  \__,_| (_)                                               
                                                                                                                                                           
                                                                \033[0m""")

    ERROR_log = [' ' * x for x in range(0, 21)]

    if l == 'admin' and p == 'admin':
        start_ADMIN_main()

    elif ((l in ERROR_log) or (l[0].isalpha() == False) or (len(l) < 5) or (len(l) > 20)) and \
            ((p == l) or (p in ERROR_log) or (len(p) < 6) or (len(p) > 30)):
        print('\033[0m\033[31m[ERROR]: Неккоректный ввод')
        print(
            '\033[0m\033[5m[ПОДСКАЗКА]: логин должен начинаться с буквы и состоять не менее чем из 4 символов и не более чем из 20 символов')
        input(
            '\033[0m\033[5m[ПОДСКАЗКА]: пароль не может совпадать с логином, должен состоять не менее чем из 6 символов и не более чем из 30 символов')

    elif (l in ERROR_log) or (l[0].isalpha() == False) or (len(l) < 4) or (len(l) > 20):
        print('\033[0m\033[31m[ERROR]: Неккоректный ввод')
        input(
            '\033[0m\033[5m[ПОДСКАЗКА]: логин должен начинаться с буквы и состоять не менее чем из 4 символов и не более чем из 20 символов')

    elif (p == l) or (p in ERROR_log) or (len(p) < 6) or (len(p) > 30):
        print('\033[0m\033[31m[ERROR]: Неккоректный ввод')
        input(
            '\033[0m\033[5m[ПОДСКАЗКА]: пароль не может совпадать с логином, должен состоять не менее чем из 6 символов и не более чем из 30 символов')

    else:
        user_object = DATABASE.User(l, p)
        DATABASE.users_list.append(user_object)
        start_USER_main()

        # flag = 0
        # for i in DATABASE.users_list:
        #     if i.login == l & i.password == p:
        #         user_object = DATABASE.User(l, p)
        #         flag = 1
        #         start_USER_main()
        #
        # if flag != 1:
        #     key = input('\033[0m\033[5m[ПРЕДУПРЕЖДЕНИЕ]: Ваш логин или пароль не найден или введен некорректно.\n'
        #           ' Убедитесь в достоверности введеных данных или Вы хотите создать новый аккаунт?\n'
        #                 'Вернуться к вводу данных - b , Создать новый аккаунт - c')
        #     if key == 'b':
        #         continue
        #     if key == 'c':
        #         user_object = DATABASE.User(l, p)
        #         DATABASE.users_list.append(user_object)
        #         start_USER_main()

######################################################################################################
